; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	infrared3 - mode
	infrared2 - mode
	image1 - mode
	spectrograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star8 - direction
	Star6 - direction
	Star0 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Phenomenon15 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star6)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 image1)
	(supports instrument2 infrared3)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star0)
	(calibration_target instrument2 Star6)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Planet9 infrared3)
	(have_image Planet10 infrared2)
	(have_image Star11 image1)
	(have_image Planet12 image1)
	(have_image Star13 image1)
	(have_image Planet14 spectrograph0)
	(have_image Phenomenon15 infrared2)
))

)

; plan
1. (turn_to satellite1 star0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 star0)
   goals met: 0 of 8
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 8
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 8
4. (turn_to satellite1 planet10 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet10)
   goals met: 0 of 8
5. (take_image satellite1 planet10 instrument2 infrared2)
   added: (have_image planet10 infrared2)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon15 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 phenomenon15)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation4)
   goals met: 1 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
9. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 1 of 8
10. (take_image satellite1 phenomenon15 instrument2 infrared2)
   added: (have_image phenomenon15 infrared2)
   goals met: 2 of 8
11. (turn_to satellite0 planet14 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet14)
   goals met: 2 of 8
12. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 3 of 8
13. (turn_to satellite0 planet9 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet9)
   goals met: 3 of 8
14. (take_image satellite0 planet9 instrument0 infrared3)
   added: (have_image planet9 infrared3)
   goals met: 4 of 8
15. (turn_to satellite0 star0 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star0)
   goals met: 5 of 8
16. (turn_to satellite1 planet12 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 planet12)
   goals met: 5 of 8
17. (take_image satellite1 planet12 instrument2 image1)
   added: (have_image planet12 image1)
   goals met: 6 of 8
18. (turn_to satellite1 star11 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 star11)
   goals met: 6 of 8
19. (take_image satellite1 star11 instrument2 image1)
   added: (have_image star11 image1)
   goals met: 7 of 8
20. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 7 of 8
21. (take_image satellite1 star13 instrument2 image1)
   added: (have_image star13 image1)
   goals met: 8 of 8
